import React from 'react'

function Privacy_policy() {
  return (
    <div className="pageTransition dark:bg-black">
                <div className="relative min-h-screen py-8 overflow-hidden">
                    <div className="md:container md:mx-auto px-20">
                        <div className="text-center mb-16">
                            <h1 className="tracking-tighter text-blue-500 text-4xl font-inter-bold mb-1">Privacy Policy</h1>
                            <p className="text-xl dark:text-white">นโยบายความเป็นส่วนตัวของ EasyPhoto</p>
                        </div>
                        <div className="space-y-8 dark:text-white">
                            <p>  ขอบคุณที่ใช้บริการของ EasyPhoto เว็บไซต์ที่ให้บริการช่างภาพและผู้ให้เช่าอุปกรณ์ถ่ายภาพ โดยเราใส่ใจความเป็นส่วนตัวของคุณอย่างยิ่ง โปรดอ่านนโยบายความเป็นส่วนตัวนี้เพื่อเข้าใจว่าเราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณอย่างไร และวัตถุประสงค์ในการใช้ข้อมูลดังกล่าว</p>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">1. ข้อมูลที่เราเก็บรวบรวม</h1>
                                <p>เราจะเก็บรวบรวมข้อมูลส่วนบุคคลที่คุณให้มาในระหว่างการสมัครสมาชิกและยืนยันข้อมูลตัวตนบนเว็บไซต์ของเรา ข้อมูลที่เราเก็บรวบรวมอาจประกอบด้วย:</p>
                                <p>  1. ชื่อและนามสกุล</p>
                                <p>  2. เลขบัตรประจำตัวประชาชน</p>
                                <p>  3. รูปถ่ายบัตรประจำตัวประชาชน</p>
                                <p>  4. รูปถ่ายหน้าตรง</p>
                                <p>  5. ที่อยู่</p>
                                <p>นอกจากนี้ เราอาจจะเก็บรวบรวมข้อมูลเกี่ยวกับผลงานของช่างภาพที่อัพโหลดไปยังเว็บไซต์ของเรา เพื่อให้บริการแสดงผลงานในโปรไฟล์ของช่างภาพ</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">2. วัตถุประสงค์ในการใช้ข้อมูล</h1>
                                <p>ข้อมูลที่เรารวบรวมจะถูกใช้เพื่อวัตถุประสงค์ต่อไปนี้:</p>
                                <p>  1. ให้บริการและการดำเนินการของเว็บไซต์ EasyPhoto</p>
                                <p>  2. ติดต่อและสื่อสารกับสมาชิก</p>
                                <p>  3. ตรวจสอบและยืนยันข้อมูลตัวตนของสมาชิก</p>
                                <p>  4. แสดงโปรไฟล์และผลงานของช่างภาพ</p>
                                <p>  5. แสดงโปรไฟล์และสินค้าที่ให้เช่าของผู้ให้เช่าอุปกรณ์ถ่ายภาพ</p>
                                <p>  6. ปรับปรุงและพัฒนาบริการของเรา</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">3. การเปิดเผยข้อมูล</h1>
                                <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณในกรณีต่อไปนี้:</p>
                                <p>  1. เมื่อเราได้รับความยินยอมจากคุณ</p>
                                <p>  2. เมื่อเราต้องการปฏิบัติตามกฎหมายหรือคำสั่งจากหน่วยงานรัฐบาล</p>
                                <p>  3. เมื่อเราเชื่อว่าการเปิดเผยเป็นสิ่งจำเป็นเพื่อป้องกันความเสี่ยงต่อความเป็นส่วนตัวของคุณหรือของบุคคลอื่น</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">4. การรักษาความปลอดภัยของข้อมูล</h1>
                                <p>   เราใช้มาตรการรักษาความปลอดภัยที่เหมาะสมเพื่อป้องกันข้อมูลส่วนบุคคลของคุณจากการสูญหายหรือการเข้าถึงโดยไม่ได้รับอนุญาต</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">5. การเก็บรักษาข้อมูล</h1>
                                <p>   เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณเฉพาะเมื่อเรามีความจำเป็นต่อการดำเนินการที่กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้ หรือตามกฎหมายที่มีผลบังคับใช้</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">6. การเปลี่ยนแปลงข้อกำหนด</h1>
                                <p>   เราอาจปรับปรุงหรือเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้เมื่อมีความจำเป็น การเปลี่ยนแปลงทั้งหมดจะถูกประกาศในเว็บไซต์ของเรา โปรดตรวจสอบนโยบายความเป็นส่วนตัวเป็นประจำเพื่อทราบถึงการเปลี่ยนแปลงที่อาจมีผลต่อคุณ การใช้บริการของเราต่อจากการเปลี่ยนแปลงเหล่านี้ถือเป็นการยินยอมของคุณต่อนโยบายที่มีผลบังคับใช้ใหม่โดยตรง</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">7. การติดต่อเรา</h1>
                                <p>   หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวหรือการใช้บริการของเรา หรือหากคุณต้องการขอข้อมูลเพิ่มเติมเกี่ยวกับข้อมูลส่วนบุคคลของคุณที่เราเก็บรวบรวม กรุณาติดต่อเราทางอีเมล info@easyphoto.com ทางทีมงานของเรายินดีให้ความช่วยเหลือและแก้ไขปัญหาที่เกี่ยวข้องให้กับคุณที่รวดเร็วและมีประสิทธิภาพที่สุด ขอบคุณที่ให้ความสนใจในเว็บไซต์ EasyPhoto และเรายินดีที่จะได้รับใช้คุณอย่างเต็มที่</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
  )
}

export default Privacy_policy
