import React from 'react'

function Termofservice() {
    return (

            <div className="pageTransition dark:bg-black">
                <div className="relative min-h-screen py-24 overflow-hidden">
                    <div className="md:container md:mx-auto px-20">
                        <div className="text-center mb-16">
                            <h1 className="tracking-tighter text-blue-500 text-4xl font-inter-bold mb-1">Terms of Service</h1>
                            <p className="text-xl dark:text-white">ข้อกำหนดและเงื่อนไขในการให้บริการ</p>
                        </div>
                        <div className="space-y-8 dark:text-white">
                            <p>  ในการใช้งานบริการ EasyPhoto จะมีข้อกำหนดและเงื่อนไขในการให้บริการที่ทาง EasyPhoto ได้กำหนดไว้ และนี้คือข้อกำหนดต่างๆ ที่ผู้ใช้งานควรรับทราบ โดยหากมีการเปลี่ยนแปลงใดๆ ทาง EasyDonate จะแจ้งก่อนล่วงหน้าให้ทราบเป็นเวลา 7 วัน</p>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">1. การสมัครสมาชิกและการใช้บริการ</h1>
                                <p>  1. ในการสมัครสมาชิกเพื่อรับเงินโดเนทนั้น ผู้สมัครต้องมีอายุไม่ต่ำกว่า 13 ปี หากในกรณีที่ผู้สมัครมีอายุไม่ถึง 13 ปี จะต้องได้รับความยินยอมจากผู้แทนโดยชอบธรรมตามกฎหมาย</p>
                                <p>  2. ข้อมูลต่างๆ ที่ผู้สมัครกรอกเข้ามา ไม่ว่าจะเป็นข้อมูลที่ใช้ในการระบุตัวตน หรือช่องทางการรับเงินต่างๆ จะต้องเป็นข้อมูลจริงทุกประการ (ในกรณีที่ผู้สมัครไม่ต้องการที่จะเปิดเผยตัวตนสู่สาธารณะ ยกตัวอย่างเช่น กลุ่ม Vtuber สามารถแก้ไขชื่อผู้ใช้งานและข้อมูลต่างๆ ที่จะแสดงสู่สาธารณะได้ รวมถึงช่องทางการชำระเงินที่สามารถใช้ช่องทางที่ผ่านตัวกลางอย่าง GB Prime Pay เพื่อปกปิดข้อมูลส่วนตัวต่างๆ ที่จะปรากฏเมื่อทำรายการผ่านช่องทางที่เป็นการรับเงินเข้าบัญชีผู้ใช้งานโดยตรง)</p>
                                <p>  3. ผู้สมัครจำเป็นที่จะต้องยอมรับและปฏิบัติตามข้อกำหนดและเงื่อนไขในการให้บริการ ก่อนทำการสมัครสมาชิก</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">2. กฏระเบียบและข้อบังคับ</h1>
                                <p>  1. อนุญาตให้นำ EasyPhoto ไปใช้เป็นช่องทางการรับเงินสำหรับการบริจาคเงินเท่านั้น เช่น การโดเนทขึ้นจอสตรีม การโดเนทเพื่อสนับสนุนครีเอเตอร์</p>
                                <p>  2. ไม่อนุญาตให้นำ EasyPhoto ไปใช้เป็นช่องทางการรับเงินสำหรับเชิงพาณิชย์ใดๆ ทั้งสิ้น</p>
                                <p>  3. ในการปรับแต่งชื่อ รูปภาพ หรือข้อความในโปรไฟล์หรือในหน้ารับเงิน จะต้องไม่พาดพิงหรือทำให้เกิดความเสียหายต่อบุคคลหรือทรัพย์สิน</p>
                                <p>  4. หากผู้ใช้งานไม่ปฏิบัติตามกฏระเบียบและข้อบังคับทั้งหมดที่กล่าวมา เป็นสาเหตุให้เกิดข้อผิดพลาดหรือความเสียหายใดๆ ทางเรา จะไม่มีการรับผิดชอบต่อความเสียหายใดๆ ทั้งสิ้น และขอสงวนสิทธิ์ในการระงับการใช้บริการทั้งหมดโดยไม่ได้แจ้งให้ทราบก่อนล่วงหน้า</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">3. การจำกัดจำนวนครั้งในการแจ้งเตือนโดเนทขึ้นจอของแพ็คเกจ</h1>
                                <p>  1. การจำกัดการโดเนทขึ้นจอเป็นเพียงการจำกัดการแจ้งเตือนไปยังจอสตรีมเท่านั้น ไม่ได้จำกัดการรับเงินเข้าบัญชีของผู้ใช้งานแต่อย่างใด</p>
                                <p>  2. ถึงจำนวนครั้งในการรับเงินของเดือนนั้นจะครบหรือเลยจำนวนที่ถูกจำกัดแล้ว ผู้ใช้งานก็จะยังสามารถรับเงินเข้าบัญชีได้ไม่จำกัด แต่จะไม่มีการแจ้งเตือนไปยังจอสตรีมเพียงเท่านั้น</p>
                                <p>  3. หากผู้ใช้งานไม่ปฏิบัติตามกฏระเบียบและข้อบังคับทั้งหมดที่กล่าวมา เป็นสาเหตุให้เกิดข้อผิดพลาดหรือความเสียหายใดๆ ทางเรา  จะไม่มีการรับผิดชอบต่อความเสียหายใดๆ ทั้งสิ้น และขอสงวนสิทธิ์ในการระงับการใช้บริการทั้งหมดโดยไม่ได้แจ้งให้ทราบก่อนล่วงหน้า</p>
                                <p>  4. การตัดรอบการจัดกัดจำนวนครั้ง จะตัดทุกๆ 1 เดือน โดยจะนับตั้งแต่วันที่สมัครใช้งาน ไม่ว่าจะเป็นสมัครใช้งานบัญชีผู้ใช้งานใหม่ และการเช่าแพ็คเกจต่างๆ ตัวอย่างเช่น สมัครสมาชิกหรือสมัครแพ็คเกจใหม่วันที่ 05/05/23 ก็จะตัดรอบวันที่ 06/05/23 และตัดรอบทุกๆ วันที่ 5 ของทุกเดือน เป็นต้น</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">4. การรักษาความปลอดภัย</h1>
                                <p>  1. เราเก็บรหัสผ่านของผู้ใช้งานจะถูกเข้ารหัส (hash) ไว้ และยืนยันรหัสผ่านด้วยการ verify hash ดังนั้น จะไม่สามารถมองเห็นรหัสผ่านได้ และจะไม่มีผู้ใช้ใดทราบรหัสผ่านนอกจากตัวผู้ใช้งานเอง</p>
                                <p>  2. รูปภาพ เอกสาร หรือข้อมูลสำคัญต่างๆ ของผู้ใช้งาน เช่น สำเนาบัตรประชาชน จะถูกอัพโหลดไว้ที่ Cloudflare R2 และมีการเข้ารหัสไว้ และกุญแจในการถอดรหัสข้อมูลจะถือโดยผู้บริการเท่านั้น</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">5. การปรับปรุงและการเปลี่ยนแปลง</h1>
                                <p>  1. ข้อกำหนดและเงื่อนไขในการให้บริการฉบับนี้ ถูกร่างขึ้นวันที่ 09/07/23 และมีการแก้ไขล่าสุดเวลา 23:22 ของวันที่ 09/07/23 (หากมีการแก้ไข จะทำการอัพเดตข้อมูลวันที่แก้ไขไว้)</p>
                                <p>  2. หากมีการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขในการให้บริการฉบับนี้ จะมีการแจ้งให้ทราบผ่านทาง Facebook Page เท่านั้น โดยถือว่าผู้ใช้งานได้ยอมรับเงื่อนไขใหม่ที่เกิดขึ้นแล้ว</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

    )
}

export default Termofservice