import React from 'react'

function Termofservice() {
    return (

            <div className="pageTransition dark:bg-black">
                <div className="relative min-h-screen py-24 overflow-hidden">
                    <div className="md:container md:mx-auto px-20">
                        <div className="text-center mb-16">
                            <h1 className="tracking-tighter text-blue-500 text-4xl font-inter-bold mb-1">Terms of Service</h1>
                            <p className="text-xl dark:text-white">ข้อกำหนดและเงื่อนไขในการให้บริการ</p>
                        </div>
                        <div className="space-y-8 dark:text-white">
                            <p>  ยินดีต้อนรับเข้าสู่เว็บไซต์  EasyPhoto เว็บไซต์นี้จัดทำขึ้นโดยทีมงาน EasyPhoto ผู้เข้าเยี่ยมชมเว็บไซต์นี้จะต้องยินดีทำตามข้อกำหนดเเละเงื่อนไขที่กำหนดไว้ 
ดังนั้นโปรดอ่านข้อกำหนดและเงื่อนไขเหล่านี้ด้วยความระมัดระวังก่อนกระทำการใดๆ บนเว็บไซต์นี้</p>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">1. การใช้บริการเว็บไซต์</h1>
                                <p>  1. เว็บไซต์นี้ประกอบด้วยเนื้อหาต่าง ๆ ทั้งที่เป็นตัวอักษร รูปภาพและเสียง ซึ่งได้รับความ คุ้มครองในด้านลิขสิทธิ์ และทรัพย์สินทางปัญญาประเภทอื่นๆ 
สิขสิทธิและทรัพย์สินทางปัญญา ทั้งหลายที่บรรจุในเว็บไซต์นี้เป็นกรรมสิทธิของ www.EasyPhoto.com ได้รับอนุญาตจากผู้มีสิทธิเหล่านั้นให้สามารถใช้เป็นส่วนหนึ่งของเว็บไซต์นี้ได้</p>
                                <p>  2. เว็บไซต์นี้ประกอบด้วยเครื่องหมายการค้า ทั้งเครื่องหมายคำว่า EasyPhoto และสัญลักษณ์เครื่องหมายการค้าที่ปรากฏในเว็บไซต์เหล่านี้เป็นกรรมสิทธิของทีมงาน EasyPhoto หรือผู้ที่ได้รับอนุญาตจากเจ้าของเครื่องหมายการค้าเหล่านั้นให้ใช้ในเว็บไซต์นี้ได้</p>
                                <p>  3. เมื่อท่านสมัครเป็นสมาชิกของเว็บไซต์นี้และได้สร้างเนื้อหาและข้อมูลประเภทต่างๆ กรรมสิทธิ์และความเป็นเจ้าของเนื้อหาต่างๆที่สร้างขึ้นยังคงเป็นของท่าน แต่ท่านได้ยินยอมให้ EasyPhoto.com แสดงผลงานของท่านแก่ผู้เข้าชมเว็บไซต์ทั่วไป 
และอนุญาตให้ EasyPhoto.com นำข้อมูลทุกประเภทที่ท่านสร้างขึ้นบนเว็บไซต์นี้เพื่อการวิเคราะห์ และนำเสนอต่อผู้เข้าชมเว็บไซต์ทั่วไป หรือเว็บไซต์ภายนอกได้</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">2. สำหรับช่างภาพ</h1>
                                <p>  1. ช่างภาพตกลงว่าตนจะใช้เว็บไซต์เพื่อวัตถุประสงค์ที่ถูกต้องตามกฎหมายและแสวงหาการจ้างงานเท่านั้น</p>
                                <p>  2. ช่างภาพตกลงที่จะเก็บชื่อและรหัสผ่านของตนเองด้วยความระมัดระวัง และจะไม่เปิดเผยให้บุคคลใดทราบ</p>
                                <p>  3. ช่างภาพยืนยันและยอมรับว่าตนจะเปิดเผยข้อมูลส่วนบุคคลของตนเองให้ผู้ว่าจ้างและทางเว็บไซต์ด้วยความสมัครใจ</p>
                                <p>  4. ช่างภาพรับทราบและเห็นชอบในการปฏิบัติของเว็บไซต์ เกี่ยวกับการเรียกเงินของผู้ว่าจ้างสำหรับค่าธรรมเนียมการเข้าถึงเว็บไซต์</p>
                                <p>  5. ทางเว็บไซต์จะไม่ให้ข้อมูลส่วนบุคคลของผู้หางานเเก่ผู้ว่าจ้าง โดยไม่ได้รับอนุญาติจากช่างภาพ</p>
                                <p>  6. ทางเว็บไซต์จะไม่รับผิดชอบหรือรับผิดในทางใดทางหนึ่งกรณีที่ผู้ว่าจ้างหรือผู้ใช้อื่น ๆ มีการละเมิดข้อกำหนดและเงื่อนไขการให้บริการ</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">3. สำหรับผู้ใช้</h1>
                                <p>  1. ผู้ใช้ตกลงว่าจะต้องใช้เว็บใซต์เฉพาะในวัตถุประสงค์ที่ถูกกฏหมายและเพื่อการเเสวงหาช่างภาพที่มีศักยภาพเท่านั้น</p>
                                <p>  2. ผู้ใช้จะต้องไม่ประกาศข้อมูลใดๆ ที่เป็นเท็จหรือไม่ถูกต้อง และไม่บุกรุกความเป็นส่วนตัวของผู้อื่น</p>
                                <p>  3. ผู้ใช้จะต้องไม่อัพโหลด ประกาศ เผยแพร่ แจกจ่าย ส่งเวียน หรือเก็บข้อมูลใดๆ ในทางใดทางหนึ่งที่เกี่ยวข้องกับเว็บไซต์ที่ 
                                        (1) เป็นการละเมิดกฎหมายที่ใช้บังคับหรือระเบียบข้อบังคับใดๆ 
                                        (2) เป็นการละเมิดในลักษณะใดๆ ต่อลิขสิทธิ์เครื่องหมายการค้า ความลับทางการค้า หรือสิทธิในทรัพย์สินทางปัญญา หรือกรรมสิทธิ์ของผู้อื่น หรือละเมิดความเป็นส่วนตัว หรือสิทธิส่วนบุคคลของผู้อื่น 
                                        (3) เป็นอันตราย หมิ่นประมาท หยาบคาย ลามกอนาจาร การเลือกปฏิบัติ รุกราน ข่มขู่ ไม่ถูกต้อง น่าเกลียด เหยียดเชื้อชาติ ดูหมิ่น เป็นเท็จ ไม่เหมาะสม หรือน่ารังเกียจ 
                                        (4) ในลักษณะที่ทำให้เกิดความไม่สงบทางการเมือง ศาสนา ความปลอดภัยของประเทศ หรือความมั่นคงของบริษัท หรือ 
                                        (5) มีไวรัส ม้าโทรจัน หนอน แฟ้มที่เสียหาย หรือข้อมูลอื่นๆ หรือโปรแกรมที่อาจเป็นอุปสรรค ก่อความเสียหายหรือ จำกัดการทำงานของซอฟต์แวร์หรือฮาร์ดแวร์คอมพิวเตอร์หรืออุปกรณ์การสื่อสาร โทรคมนาคม</p>
                                <p>  4. สมาชิกเว็บไซต์ที่สมัครเปิดบัญชีใช้งาน หรือใช้บริการเว็บไซต์จะต้องเป็นบุคคลที่มีอายุครบ 18 ปีบริบูรณ์แล้วเท่านั้น และต้องไม่เข้าข่ายผู้เยาว์ ผู้ไร้ความสามารถ หรือผู้เสมือนไร้ความสามารถ หากทางเว็บไซต์พบว่าท่านมีคุณสมบัติไม่เป็นไปตามที่กำหนดข้างต้น เว็บไซต์มีสิทธิ์ที่จะระงับการใช้งานบัญชีของท่านทันที</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">4. สำหรับร้านให้เช่าอุปกรณ์</h1>
                                <p>  1. ร้านให้เช่าอุปกรณ์ตกลงว่าจะต้องใช้เว็บไซต์เฉพาะในวัตถุประสงค์ที่ถูกกฏหมายและเพื่อการให้เช่าอุปกรณ์สำหรับถ่ายภาพเท่านั้น</p>
                                <p>  2. ร้านเช่าอุปกรณ์ตกลงที่จะเก็บชื่อและรหัสผ่านของตนเองด้วยความระมัดระวัง และจะไม่เปิดเผยให้บุคคลใดทราบ</p>
                                <p>  3. ยืนยันและยอมรับว่าตนจะเปิดเผยข้อมูลส่วนบุคคลของตนเองให้นายจ้างและทางเว็บไซต์ด้วยความสมัครใจ</p>
                                <p>  4. ร้านเช่าอุปกรณ์รับทราบและเห็นชอบในการปฏิบัติของเว็บไซต์ เกี่ยวกับการเรียกเงินของผู้ใช้สำหรับค่าธรรมเนียมการเข้าถึงเว็บไซต์</p>
                                <p>  5. ทางเว็บไซต์จะไม่ให้ข้อมูลส่วนบุคคลของผู้หางานเเก่ผู้ใช้ โดยไม่ได้รับอนุญาติจากร้านเช่าอุปกรณ์</p>
                                <p>  6. ทางเว็บไซต์จะไม่รับผิดชอบหรือรับผิดในทางใดทางหนึ่งกรณีที่ผู้ใช้ มีการละเมิดข้อกำหนดและเงื่อนไขการให้บริการ</p>
                            </div>
                            <div className="space-y-4">
                                <h1 className="text-xl text-blue-500 font-semibold">5. การรักษาความปลอดภัย</h1>
                                <p>  1. เราเก็บรหัสผ่านของผู้ใช้งานจะถูกเข้ารหัส (hash) ไว้ และยืนยันรหัสผ่านด้วยการ verify hash ดังนั้น จะไม่สามารถมองเห็นรหัสผ่านได้ และจะไม่มีผู้ใช้ใดทราบรหัสผ่านนอกจากตัวผู้ใช้งานเอง</p>
                                <p>  2. รูปภาพ เอกสาร หรือข้อมูลสำคัญต่างๆ ของผู้ใช้งาน เช่น สำเนาบัตรประชาชน จะถูกอัพโหลดไว้ที่ Cloudflare R2 และมีการเข้ารหัสไว้ และกุญแจในการถอดรหัสข้อมูลจะถือโดยผู้บริการเท่านั้น</p>
                            </div>
                            
                        </div>
                    </div>
                </div>
            </div>

    )
}

export default Termofservice